# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [30]:
import pandas as pd
import numpy as np
 
data= pd.read_csv(r"C:\Users\lred1\Desktop\Launchcode\SQL\clone\data-analysis-projects\data-manipulation\exercises\titanic.csv")

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [2]:
# Run the head of your data set here:
data.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# check for duplicates
data.duplicated(keep=False).sum()

np.int64(160)

In [9]:
# if there are, go ahead and drop them:
#data.count()
data = data[~data.duplicated(keep='first')]

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we work through this notebook. Apologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data intact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data.
1. Initialize it using the groupby() function and pass it the column.

In [10]:
# Code your groupby "embark_town" here:
embark_groups = data.groupby("embark_town")

In [11]:
# To view the grouped data as a table, use the variable_name.first():
embark_groups.first()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [15]:
# Code your groupby "survived" table here:
survived_groups = data.groupby("survived").describe()

# run your table below:

survived_groups

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         461.0  2.481562  0.770507  1.0  2.0  3.0  3.0  3.0  394.0
1         323.0  1.904025  0.856152  1.0  1.0  2.0  3.0  3.0  284.0

                     ... parch        fare                                     \
               mean  ...   75%  max  count       mean        std  min     25%
survived             ...
0         30.953046  ...   0.0  6.0  461.0  23.944531  33.336385  0.0   7.875
1         28.365915  ...   1.0  5.0  323.0  50.079180  68.009971  0.0  12.825


            50%       75%       max
survived
0         13.00  26.55000  263.0000
1         26.25  61.37915  512.3292

[2 rows x 40 columns]

In [16]:
# run your table with describe
data.describe()

         survived      pclass         age       sibsp       parch        fare
count  784.000000  784.000000  678.000000  784.000000  784.000000  784.000000
mean     0.411990    2.243622   29.869351    0.522959    0.415816   34.711740
std      0.492507    0.855056   14.759076    0.986231    0.836922   52.160151
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   20.000000    0.000000    0.000000    8.050000
50%      0.000000    3.000000   28.250000    0.000000    0.000000   15.900000
75%      1.000000    3.000000   39.000000    1.000000    1.000000   34.109350
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [24]:
# How is this table organized?  Why are there 40 columns now?

There are 8 describe statistics and 5 numerical columns, so 8*5 =40 columns
count
mean
std
min
25%
50% (median)
75%
max

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to apply **agg()** to your grouped data.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [19]:
# Code your method chain here:
    
survived_details = data.groupby("survived").agg("sum")
survived_details

,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
survived,,,,,,,,,,,,,,
0,1144,malemalemalemalemalemalemalefemalemalefemalema...,12195.50,255,169,11038.4286,SSQSSSSSQSSSCSSCSCSSSSSCSQCSSSCCSCSSCSSSSSCSSS...,ThirdThirdThirdFirstThirdThirdThirdThirdThirdT...,manmanmanmanchildmanmanchildchildwomanmanchild...,366,ECBCFEADCBDCBFBACAGCGCEBCADCCCCCCECCEEABCCCDCB...,SouthamptonSouthamptonQueenstownSouthamptonSou...,nonononononononononononononononononononononono...,296
1,615,femalefemalefemalefemalefemalefemalefemalefema...,8055.92,155,157,16175.5753,CSSSCSSSSCSQSSQCQCCCQCSSSSCSSSSSSQSSSCSSSQSCSC...,FirstThirdFirstThirdSecondThirdFirstSecondSeco...,womanwomanwomanwomanchildchildwomanwomanmanwom...,85,CCGCDABDCBFCDEFDCEFFBBADDCCDBCCDBCBECCECBCECDB...,CherbourgSouthamptonSouthamptonSouthamptonCher...,yesyesyesyesyesyesyesyesyesyesyesyesyesyesyesy...,150

In [21]:
# Create a variable to apply agg("sum") to your grouped data
embark_groups_agg = data.groupby("embark_town").agg("sum")
# run your table:
embark_groups_agg

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,90,282,femalefemalefemalemalemalefemalemalemalefemale...,3981.17,62,59,9875.0587,CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC...,FirstSecondThirdThirdFirstFirstFirstThirdThird...,womanchildwomanmanmanwomanmanmanchildmanchildm...,79,CBDBADBFBACBBADDCBDBCECBECBEDBECDCCDBBDCBBCCAC...,yesyesyesnonoyesnoyesyesnoyesnoyesnonononoyesn...,74
Queenstown,20,170,malemalefemalefemalefemalefemalemalefemalefema...,786.50,30,13,859.2459,QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ...,ThirdThirdThirdThirdThirdThirdThirdThirdThirdT...,manchildchildwomanwomanwomanmanwomanwomanmanma...,29,CECF,nonoyesyesyesyesnoyesyesnononoyesnoyesnoyesnon...,42
Southampton,211,1305,malefemalefemalemalemalemalefemalefemalefemale...,15383.75,318,254,16319.6993,SSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSSS...,ThirdThirdFirstThirdFirstThirdThirdThirdFirstT...,manwomanwomanmanmanchildwomanchildwomanmanmanc...,343,CEGCDACCCFFCEDCEDDCFCEBFAFGCCDGCBEBCCDACCCCDCC...,noyesyesnononoyesyesyesnononoyesyesnonoyesyesn...,328

In [8]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?
#data.dtypes
Since these are not integer columns data is concatinating.

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an organization system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this organizational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"john": ["john@email.com", 555-555-5555, "works at LaunchCode headquarters"]}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across multiple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a template for the aggregations we want to perform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine, making a subset table.

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [9]:
# Predict the table output before you uncomment the code below.

age_dictionary={"age":["sum", "max"]}
age_dictionary_agg=data.agg(age_dictionary)
age_dictionary_agg

          age
sum  21205.17
max     80.00

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [16]:
# Code your dictionary here:
survived_dictinory={"survived":["sum","count"]}
survived_dictinory_agg=data.agg(survived_dictinory)
survived_dictinory_agg
print(survived_dictinory_agg)
print(" ")

age_dictionary={"age":["std", "min"]}
age_dictionary_agg=data.agg(age_dictionary)
age_dictionary_agg
print(age_dictionary_agg)
print(" ")

sibsp_dictinory={"sibsp":["count","sum"]}
sibsp_dictinory_agg=data.agg(sibsp_dictinory)
sibsp_dictinory_agg
print(sibsp_dictinory_agg)

       survived
sum         342
count       891

           age
std  14.526497
min   0.420000

       sibsp
count    891
sum      466

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [11]:
# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
# The line below creates a new dataframe with only numeric columns to avoid warnings
num_only_data = data.select_dtypes(include='number')

# Code your groupby here using num_only_data:
plcass_group = num_only_data.groupby(data["pclass"])


# Run your table using first() here instead of head():
plcass_group.first()

        survived  pclass   age  sibsp  parch     fare
pclass
1              1       1  38.0      1      0  71.2833
2              1       2  14.0      1      0  30.0708
3              0       3  22.0      1      0   7.2500

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [14]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']


#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).
num_only = data.select_dtypes(include='number')
passenger_class = num_only.groupby("pclass")

# Pass our list to the function and run your table.

passenger_class.agg(agg_func_list)

       survived                                                                \
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

        ...        fare                                                \
        ...         sum       mean   median  min       max        std
pclass  ...
1       ...  18177.4125  84.154687  60.2875  0.0  512.3292  78.380373
2       ...   3801.8417  20.662183  14.2500  0.0   73.5000  13.417399
3       ...   6714.6951  13.675550   8.0500  0.0   69.5500  11.778142


                var    first   last count
pclass
1       6143.482816  71.2833  30.00   216
2        180.026589  30.0708  13.00   184
3        138.724622   7.2500   7.75   491

[3 rows x 50 columns]

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to perform on that column.  The code would look like this:

In [22]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
passenger_class.agg(agg_func_dict)

            age                                                             \
            sum       mean median   min   max        std         var first
pclass
1       7111.42  38.233441   37.0  0.92  80.0  14.802856  219.124543  38.0
2       5168.83  29.877630   29.0  0.67  70.0  14.001077  196.030152  14.0
3       8924.92  25.140620   24.0  0.42  74.0  12.495398  156.134976  22.0


        last count
pclass
1       26.0   186
2       27.0   173
3       32.0   355

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [24]:
# Code it here:
survived_func_dict = {
    'survived': ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
#passenger_class_survived_agg = passenger_class.agg(survived_func_dict)
#passenger_class_survived_agg
passenger_class.agg(survived_func_dict)

       survived
            sum      mean median min max       std       var first last count
pclass
1           136  0.629630    1.0   0   1  0.484026  0.234281     1    1   216
2            87  0.472826    0.0   0   1  0.500623  0.250624     1    0   184
3           119  0.242363    0.0   0   1  0.428949  0.183998     0    0   491

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In the box below:
1. Create a new column by manipulating the values of an existing column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  The inflation multiplier from 1912 to 2021 is approximately 117.17.

In [25]:
# Code your new "fare_2021" column here:
data['fare_2021'] = data['fare'] * 117.17

# Run the head of your table to see your new column:
data[['fare', 'fare_2021']].head()

      fare    fare_2021
0   7.2500   849.482500
1  71.2833  8352.264261
2   7.9250   928.572250
3  53.1000  6221.727000
4   8.0500   943.218500

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the string-based "yes","no" values in the "alive" column using booleans, replacing "yes" values with True and "no" values with False.

In [18]:
# Code your updated values here:
data['alive'] = data['alive'].map({'yes': True, 'no': False})
data[['alive']].head()

   alive
0  False
1   True
2   True
3   True
4  False

We can also use functions to update values.

1. Create a function that will convert the string-based "alive" values of "yes" or "no" to a boolean value of True or False. Apply it to your table and run your table here:

In [21]:
# Code your function here:
def alive_function_bool(value):
    if value == "yes":
        return True
    elif value == "no":
        return False
    else:
        return None 

data['alive'] = data['alive'].apply(alive_function_bool)
data[['alive']].head()

   alive
0  False
1   True
2   True
3   True
4  False

Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [32]:
# Write your max age check here:

max_age = data['age'].max()
print(f"Maximum age: {max_age}")

Maximum age: 80.0

In [33]:
# Code the new "age_group" column function here:
bins = list(range(0, int(max_age) + 10, 10))
data['age_group'] = pd.cut(data['age'], bins=bins, right=True, include_lowest=True)
data[['age', 'age_group']].head(10)

    age       age_group
0  22.0    (20.0, 30.0]
1  38.0    (30.0, 40.0]
2  26.0    (20.0, 30.0]
3  35.0    (30.0, 40.0]
4  35.0    (30.0, 40.0]
5   NaN             NaN
6  54.0    (50.0, 60.0]
7   2.0  (-0.001, 10.0]
8  27.0    (20.0, 30.0]
9  14.0    (10.0, 20.0]

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. To find this, should we set the sort order to ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [28]:
# Code your sort_values here:
highest_fare_row = data.sort_values(by='fare', ascending=False)

#Run your table here:
highest_fare_row[['fare', 'age']].head(1)

         fare   age
679  512.3292  36.0

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [37]:
# Code your pivot_table here:
observed=False 
fare_pivot = data.pivot_table(
    values='fare',              
    index=['who', 'age_group'], 
    columns='survived',         
    aggfunc="sum",             
    observed=False               
)

# Run your table here:
fare_pivot

survived                      0          1
who   age_group
child (-0.001, 10.0]   896.4583  1051.3458
      (10.0, 20.0]     213.0876   560.3293
      (20.0, 30.0]       0.0000     0.0000
      (30.0, 40.0]       0.0000     0.0000
      (40.0, 50.0]       0.0000     0.0000
      (50.0, 60.0]       0.0000     0.0000
      (60.0, 70.0]       0.0000     0.0000
      (70.0, 80.0]       0.0000     0.0000
man   (-0.001, 10.0]     0.0000     0.0000
      (10.0, 20.0]    1058.4041   176.4292
      (20.0, 30.0]    2518.3037   625.5583
      (30.0, 40.0]    1429.4705  1742.4459
      (40.0, 50.0]    1207.7708   569.3293
      (50.0, 60.0]     735.4792   171.7500
      (60.0, 70.0]     602.4375    10.5000
      (70.0, 80.0]      99.6834    30.0000
woman (-0.001, 10.0]     0.0000     0.0000
      (10.0, 20.0]     144.6250  1243.0209
      (20.0, 30.0]     419.0750  2947.6083
      (30.0, 40.0]     141.5667  3273.4124
      (40.0, 50.0]     260.4917  1502.4418
      (50.0, 60.0]      10.5000   962.8125
      (60.0, 70.0]       0.0000   167.5458
      (70.0, 80.0]       0.0000     0.0000

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [38]:
# Code your table here:
pclass_pivot = data.pivot_table(
    values='pclass',  
    columns='who',   
    aggfunc='count',  
    fill_value=0 
)    

# Run your table here:
pclass_pivot

# Answer the question here:
In fare_pivot, â€œwhoâ€ is used as row groups.

In pclass_pivot, â€œwhoâ€ is used as separate columns.

Because of this:
fare_pivot shows â€œwhoâ€ in the index and pclass_pivot shows â€œwhoâ€ in the columns.

who     child  man  woman
pclass     83  537    271

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does the **melt** function do to the data?

In [42]:
# What does melt do?
The melt function changes a table to wide to long

2.  With a new variable, apply a default melt to your data.

In [41]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)
new_name = pd.melt(data)

# Run your table here:
print(new_name.head())

# Check the shape of your new table.
new_name.shape

   variable value
0  survived     0
1  survived     1
2  survived     1
3  survived     1
4  survived     0

(14256, 2)

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [44]:
# Create your melt table here:
melt_table = pd.melt(
    data,
    id_vars=['embarked'],      
    value_vars=['fare', 'deck'] 
)

# Run your table here:
print(melt_table.head())

# Check the shape
melt_table.shape

  embarked variable    value
0        S     fare     7.25
1        C     fare  71.2833
2        S     fare    7.925
3        S     fare     53.1
4        S     fare     8.05

(1782, 3)

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?